diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Год = Параметры.Год;
	ДанныеОтпусков = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	АвтоЗаголовок = Ложь;
	Заголовок = СтрШаблон("График отпусков на %1 год", Формат(Год, "ДФ=yyyy"));
	
	// Строим Диаграмму Ганта
	ДиаграммаГанта.Очистить();
	Для Каждого Отпуск Из ДанныеОтпусков Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(Отпуск.Сотрудник);
		Серия = ДиаграммаГанта.УстановитьСерию("Отпуск");
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Отпуск.ДатаНачала;
		Интервал.Конец = Отпуск.ДатаОкончания;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
